//Deletions in OneDrive
OfficeActivity
| where UserId has ""
| where OfficeWorkload has "OneDrive"
| where Operation has "FileRecycled"
// Pulls out all sourcefilenames too see what kind of files are being deleted.
| distinct SourceFileName
