
AADNonInteractiveUserSignInLogs
| where UserPrincipalName contains ""
| where TimeGenerated > ago(24d)
| summarize count() by Location, UserPrincipalName, UserAgent

union SigninLogs, AADNonInteractiveUserSignInLogs
| where UserPrincipalName contains ""
| project TimeGenerated, Category, ResultType, ResultDescription, UserPrincipalName, AuthenticationRequirement, ClientAppUsed, UserAgent, IPAddress, Location

#check potential MFA token stealing and password
union SigninLogs, AADNonInteractiveUserSignInLogs
| where UserPrincipalName contains ""
| where UserAgent contains "richclient"
| project TimeGenerated, Category, ResultType, ResultDescription, UserPrincipalName, AuthenticationRequirement, ClientAppUsed, UserAgent, IPAddress, Location
