
AADNonInteractiveUserSignInLogs
| where UserPrincipalName contains ""
| where TimeGenerated > ago(24d)
| summarize count() by Location, UserPrincipalName, UserAgent

union SigninLogs, AADNonInteractiveUserSignInLogs
| where UserPrincipalName contains ""
| project TimeGenerated, Category ResultType, ResultDescription, UserPrincipalName, AuthenticationRequirement, ClientAppUsed, UserAgent, IPAddress, Location

| where ResultType != 0
