
AADNonInteractiveUserSignInLogs
| where UserPrincipalName contains ""
| where TimeGenerated > ago(24d)
| summarize count() by Location, UserPrincipalName, UserAgent

Union SigninLogs, AADNonInteractiveUserSignInLogs
| where UserPrincipalName contains ""
| project TimeGenerated, ResultType, ResultDescription, UserPrincipalName, AuthenticationRequirement, ClientAppUsed, UserAgent, IPAddress, Location

| where ResultType != 0
