OfficeActivity
| where TenantId == "TenantID"
| project TimeGenerated, TenantId, UserAgent, RecordType, ClientIP, Client_IPAddress, Operation, OfficeWorkload


OfficeActivity
| where TenantId has ""
| where Operation contains "Download"
//ClientIP should be empty to see what has ip has the most Downloads. (Downloads can be changed to something else)
| where ClientIP has ""
| summarize count()by ClientIP
